#+BEGIN_COMMENT
.. title: org-mode测试
.. slug: org-mode-test
.. date: 2018-11-01 08:58:35 UTC+08:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text
.. author: lampze
#+END_COMMENT


#+OPTIONS: \n:t

* 一级标题
** 二级标题
*** 三级标题
**** 四级标题
***** 五级标题
****** 六级标题
******* 七级标题
******** 八级标题

* 列表
{{{TEASER_END}}}
**** Lord of the Rings
   My favorite scenes are (in this order)
   1. The attack of the Rohirrim
   2. Eowyn's fight with the witch king
      + this was already my favorite scene in the book
      + I really like Miranda Otto.
   3. Peter Jackson being shot by Legolas
      - on DVD only
      He makes a really funny face when it happens.
ORG-LIST-END-MARKER
   But in the end, no individual scenes matter but the film as a whole.
   Important actors in this film are:
   - Elijah Wood :: He plays Frodo
   - Sean Austin :: He plays Sam, Frodo's friend.  I still remember
     him very well from his role as Mikey Walsh in The Goonies.
ORG-LIST-END-MARKER

* 表格
| 数量 | 单价 |  总额 |
|------+------+-------|
|    2 | 3.45 |   6.9 |
|    4 | 4.34 | 17.36 |
|    5 | 3.44 |  17.2 |
|    5 |  5.6 |   28. |
#+TBLFM: $3=$1*$2

* 字体
*粗体*
/斜体/
+删除线+
_下划线_
下标： H_2 O
上标： E=mc^2
等宽字：  =git=

* 分割线
-----
-----
-----

* 元数据
#+BEGIN_EXAMPLE
这是一个例子
#+END_EXAMPLE

#+BEGIN_QUOTE
这是一个引用
#+END_QUOTE

#+BEGIN_SRC c
#include <stdio.h>
int main() {
    printf("Hello World");
    return 1;
}
#+END_SRC

#+BEGIN_CENTER
这是一个居中区块
#+END_CENTER

#+BEGIN_COMMENT
这是一个块注释
#+END_COMMENT
